<template>
  <div class="letters">    
    <main  class="main">  
      <div class="msg">
        <p>お手紙が届いています</p>  
      </div>  
      <div class="letter">
          <p>とわへ</p>
          <p>おれらがつきあいはじめて１ねんたったね。</p>
          <p>あえないじかんがめっちゃながくて、、</p>
          <p>しかもあえるじかんはかぜのようにとおりすぎて、、</p>
          <p>おれらとってはつらくてながい１ねんだったね。</p>
          <p>いちねんかんほんとうにありがとうね</p>
          <p>おれがそうぞういじょうにガキでとわにたくさんふたんかけた。</p>
          <p>それだけじゃなくて、おれのことばでとわをたくさんきずつけた。</p>
          <p>こんなことばですませるのがさいあくにおもえるくらい、つぐないようがないくらいきずつけたよね。</p>
          <p>ごめんね、こころのそこからごめん。</p>
          <p>ほんとにはんせいしてる</p>
          <p>つぎはこんなことくりかえさないいちねんにしたい</p>
          <p>なんでこんなじょうきょうでもおれらがつづいているんだろうね</p>
          <p>もしまったくのたにんがおれらのかいわのいちぶしじゅうをきいて、まいしゅうおれらのことみたらほんとにハテナであたまぱんぱんになっちゃうとおもう( ´∀｀ )</p>
          <p>それくらいたいへんなじょうきょうがつづいたのに、ここまでおれをひきとめてくれてありがとう</p>
          <p>でもそれはおたがいさまかな？（おれがいうなって？( ´∀｀ )）</p>        
          <p>ほんとにかんしゃしてるよ。ありがとう。</p>
          <p>いままでのせいかつがしあわせにあふれてたかといったらぜんぜんそうじゃないけど、</p>
          <p>おれにとってとわはかけがえのないひとでいちばんたいせつなひとだってわかった</p>
          <p>とわ！だいすき！</p>
          <p>おれがこんなになにかをうしなうことにたいしてなみだをながすともしらなかった</p>
          <p>もとからわかってたはずだけど、さらにそのおもいがつよくなったきがする</p>
          <p>あえなくて、しょうじき、そのおもいがぼんやりとあいまいになってたかもしれない</p>
          <p>でもとわがNZからかえってきてくれたおかげで、とわのかわいさとかあまえかたとか、あたまのなでなでかんとかたくさんかんじて、やっぱりおれにはとわがひつようだっておもった。</p>
          <p>でもおれは、ばかだからそういうのすぐわすれるし、そういうのをうしなってからやっとちゃんとかんじるみたい</p>
          <p>こういうのをわかってるのに、うしなわないとわからないんだよ。。。ほんとにばかでごめんね。</p>
          <p>でも、いまはわかるから、かいてつたえたいし、ちゃんとみらいのようへいくんにもつたえたい</p>
          <p>やっぱりとわにすぐにあいたいし、ケンカしちゃうかもだけど、ながくいっしょにいたい</p>
          <p>このタイミングでNZからかえってきてくれてありがとう</p>
          <p>とわのこれからがどうなるかはわからないけど、たくさんあおうね</p>
          <p>そしてこれまでのつぐないをさせて。</p>
          <p>たとえばねー</p>
          <p>1じかんマッサージけんとか？</p>
          <p>あ！ほんのよみきかせとかいいじゃん！</p>
          <p>まえ、おれがやったのにほぼきいてなかったからこんどはちゃんときいてね！</p>
          <p>いろんなこといっしょにしよ</p>
          <p>たくさんたのしませるから</p>
          <p>たまにひどいジョークでおこらせたりしたらごめんね( ´∀｀ )</p>
          <p>とりあえずこのいちねんかんはそうぞうつかなかったね</p>
          <p>きっとつぎのいちねんもはらんばんじょうないちねんになるんだろうなぁ</p>
          <p>いっしょにおでかけしたり、ごはんつくったり、たくさんねたり</p>
          <p>そんなひがいちねんめよりふえればいいなぁ</p>
          <p>ほんとにいままでありがとう、とわ。</p>
          <p>だいすき！だいすき！だいすき！</p>
          <p>これからもよろしくね</p>
          <p style="text-align:right; margin-right:20px;">ようへいより</p>
          <p style="margin-top:50px;">P.S.</p>
          <p>ちょっとからだのしたのほうにふあんがのこるようへいくんですが、しょうらいのためにどりょくするのでゆるしてください。</p>
          <p>おねがいします。</p>
          <p style="margin-top:100px;">P.S.2.</p>
          <p>このもじ、みづらかったよね</p>
          <p>ちょっとごめんm(__)m</p>
          <p>でも、きたないじのほうがきおくにのこりやすいからふたりともハッピーでしょ？</p>
          <p>このほうがきもちつたわりやすいかなとおもったからためしてみました</p>
          <p>こんどのてがみはどうしよっかなぁ</p>
          <p>ちょくせつわたしたいけど、どうせならなにかのきねんにわたしたいからなぁ</p>
          <p>まぁかんがえとくよ</p>
          <p style="margin-top:100px;">P.S.3.</p>
          <p>PSかきすぎた( ´∀｀ )）</p>
          <p>これがラスト！</p>
          <p>いまのおもいをぶつけるよ</p>
          <p>とわーーー！！だいすきーー！！あいたいーーー！！</p>
          <p>ながくなったからつかれたぁー</p>
          <p>ばいばーい</p>

        </div>
    </main>
  </div>
</template>

<script>
export default {
  name: 'Letter',
  props: {
    msg: String
  }
}
</script>

<style scoped>
/*letters*/
.main{
  position: relative;
  top: 70px;
}
.letter{
    text-align: center;        
    font-family: 'からかぜ';
    font-size: 24px;
    color: #222;
    background-color: #fee;
    padding: 50px 10px;
    margin: 0 30px;
    text-align: left;
    max-width: 90%;
    min-width: 250px;
    margin: 0 auto;
    /* color: #fff; */
}
/* .letter:hover{
  color: #333
} */

@media screen and (min-width:768px) {
  .letter{
    max-width: 700px;
  }
}
@font-face {
    font-family: 'からかぜ';
    src: url('../assets/karakaze_font/karakaze-M.otf');    
}

</style>
